fdfea/Capstone_MSP432/get_time.c
    // If SSID_NAME is defined as a non-empty string, copy into SSID name buffer
    if (Str_Length)
    {
        /* Copy the Default SSID to the local variable                        */
        strncpy(SSID_Remote_Name, SSID_NAME, Str_Length);
    }

    GPIO_write(Board_LED0, Board_LED_OFF);
    GPIO_write(Board_LED1, Board_LED_OFF);
    GPIO_write(Board_LED2, Board_LED_OFF);

    /* Reset The state of the machine                                         */
    Network_IF_ResetMCUStateMachine();

    /* Start the driver                                                       */
    lRetVal = Network_IF_InitDriver(ROLE_STA);
    if (lRetVal < 0)
    {
        UART_PRINT("Failed to start SimpleLink Device\n\r", lRetVal);
        return -1;
    }

    /* switch on Green LED to indicate Simplelink is properly up.             */
    GPIO_write(Board_LED2, Board_LED_ON);

    // Start Timer to blink Red LED till AP connection
    LedTimerConfigNStart();

    /* Initialize AP security params                                          */
    SecurityParams.Key = (signed char *) SECURITY_KEY;
    SecurityParams.KeyLen = strlen(SECURITY_KEY);
    SecurityParams.Type = SECURITY_TYPE;

    /* Connect to the Access Point                                            */
    lRetVal = Network_IF_ConnectAP(SSID_Remote_Name, SecurityParams);
    if (lRetVal < 0)
    {
        UART_PRINT("Connection to an AP failed\n\r");
        return -1;
    }

    // Disable the LED blinking Timer as Device is connected to AP.
    LedTimerDeinitStop();

    // Switch ON RED LED to indicate that Device acquired an IP.
    GPIO_write(Board_LED0, Board_LED_ON);

    sleep(1);

    GPIO_write(Board_LED0, Board_LED_OFF);
    GPIO_write(Board_LED1, Board_LED_OFF);
    GPIO_write(Board_LED2, Board_LED_OFF);

    return 0;
}

/***********************************************************
  Function: getHostIPforWeather
*/
static int32_t getHostIPforWeather(void)
{
    int32_t status = -1;

    /* Receive IP for host based on the address */
    status = sl_NetAppDnsGetHostByName((signed char *)App_CB.weatherHostName,
                                       strlen((const char*)App_CB.weatherHostName),
                                       (unsigned long*)&App_CB.weatherDestinationIP,
                                       SL_AF_INET);
    ASSERT_ON_ERROR(status);

    return 0;
}

/***********************************************************
  Function: getHostIPforDate
*/
static int32_t getHostIPforDate(void)
{
    int32_t status = -1;
    App_CB.timeDestinationIP = 0;

    /* Retreive IP for host based on the address */
    status = sl_NetAppDnsGetHostByName((signed char *)App_CB.timeHostName,
                                       strlen((const char*)App_CB.timeHostName),
                                       (unsigned long*)&App_CB.timeDestinationIP,
                                       SL_AF_INET);
    ASSERT_ON_ERROR(status);

    return 0;
}

/***********************************************************
  Function: createConnectionforWeather
*/
static int32_t createConnectionforWeather(void)
{
    SlSockAddrIn_t  Addr;

    int16_t sd = 0;
    int16_t AddrSize = 0;
    int32_t ret_val = 0;

    Addr.sin_family = SL_AF_INET;
    Addr.sin_port = sl_Htons(80);

    /* Change the DestinationIP endianity, to big endian */
    Addr.sin_addr.s_addr = sl_Htonl(App_CB.weatherDestinationIP);

    AddrSize = sizeof(SlSockAddrIn_t);

    sd = sl_Socket(SL_AF_INET,SL_SOCK_STREAM, 0);
    if( sd < 0 )
    {
        UART_PRINT(" Error creating socket\n\r\n\r");
        ASSERT_ON_ERROR(sd);
    }

    ret_val = sl_Connect(sd, ( SlSockAddr_t *)&Addr, AddrSize);
    if( ret_val < 0 )
    {
        /* error */
        UART_PRINT(" Error connecting to server\n\r\n\r");
        ASSERT_ON_ERROR(ret_val);
    }

    return sd;
}

/***********************************************************
  Function: createConnectionforDate
*/
static int32_t createConnectionforDate(void)
{
    int32_t sd = 0;
    struct SlTimeval_t TimeVal;

    sd = sl_Socket(SL_AF_INET, SL_SOCK_DGRAM, /*SL_IPPROTO_UDP*/ 0);
    if( sd < 0 )
    {
        UART_PRINT(" Error creating socket\n\r\n\r");
        ASSERT_ON_ERROR(sd);
    }

    TimeVal.tv_sec = TIMEOUT_SEC;
    TimeVal.tv_usec = TIMEOUT_USEC;
    sl_SetSockOpt(sd,SL_SOL_SOCKET,SL_SO_RCVTIMEO, (_u8 *)&TimeVal,sizeof(TimeVal));

    return sd;
}

/***********************************************************
  Function: getForecastData
*/
static int32_t getForecastData(void)
{
    uint8_t *p_startPtr = NULL;
    uint8_t *p_endPtr = NULL;
    uint8_t* p_bufLocation = NULL;
    uint8_t  temp_endValue;
    int32_t  retVal = -1;
    int8_t   newDay = 1;
    uint8_t  msgIndex;
    uint16_t dataIndex;
    uint16_t recvBuffoffset;

    UART_PRINT("Start getforecastdata\n\r");
    memset(App_CB.weatherRecvbuff, 0, sizeof(App_CB.weatherRecvbuff));

    /* Puts together the HTTP GET string. */
    p_bufLocation = App_CB.weatherSendBuff;
    strcpy((char *)p_bufLocation, PREFIX_BUFFER);

    p_bufLocation += strlen(PREFIX_BUFFER);
    strcpy((char *)p_bufLocation, (const char *)App_CB.weatherCityName);

    p_bufLocation += strlen((const char *)App_CB.weatherCityName);
    strcpy((char *)p_bufLocation, POST_BUFFER);

    p_bufLocation += strlen(POST_BUFFER);
    strcpy((char *)p_bufLocation, POST_BUFFER2);

    /* Send the HTTP GET string to the open TCP/IP socket. */
    retVal = sl_Send(App_CB.weatherSockID, App_CB.weatherSendBuff,
                     strlen((const char *)App_CB.weatherSendBuff), 0);

    UART_PRINT("strlen: %d \n\r", strlen((const char *)App_CB.weatherSendBuff));
    UART_PRINT("retval: %d \n\r", retVal);

    if(retVal != strlen((const char *)App_CB.weatherSendBuff))
        ASSERT_ON_ERROR(retVal);

    /* Receive response */
    for (msgIndex = 0; msgIndex < 18; msgIndex++)
    {
        retVal = sl_Recv(App_CB.weatherSockID,
                         App_CB.weatherRecvbuff,
                         1000, 0);
        ASSERT_ON_ERROR(retVal);

        /* Remove unwanted characters */
        for (dataIndex = 0; dataIndex < MAX_SEND_RCV_SIZE; dataIndex++)
        {
            if (App_CB.weatherRecvbuff[dataIndex] == 0)
            {
                App_CB.weatherRecvbuff[dataIndex] = '0';
            }
        }
        App_CB.weatherRecvbuff[dataIndex] = '\0';

        recvBuffoffset = 0;

