fdfea/Capstone_MSP432/get_time.c
        if(NumDaysReceived < 5)
        {
            /* Get the date and temp string */
            p_startPtr = (uint8_t *)strstr((const char *)&App_CB.weatherRecvbuff[recvBuffoffset],
                                           "time from=");
            if( NULL != p_startPtr )
            {
                p_endPtr = (uint8_t *)strstr((const char *)p_startPtr, "/temperature>");
                if( NULL != p_endPtr )
                {
                    recvBuffoffset = p_endPtr - &App_CB.weatherRecvbuff[0];
                    temp_endValue = *p_endPtr;
                    *p_endPtr = 0;
                    usprintf((char *)locTempString,"%s",p_startPtr);
                    *p_endPtr = temp_endValue;

                    /* Parse the data */
                    p_startPtr = (uint8_t *)strstr((const char *)locTempString, "time from=");
                    p_startPtr = p_startPtr + strlen("time from=") + 1;
                    p_endPtr = (uint8_t *)strstr((const char *)p_startPtr, "T");
                    if( NULL != p_endPtr )
                    {
                        temp_endValue = *p_endPtr;
                        *p_endPtr = 0;
                        usprintf((char *)Tmp_Day[NumDaysReceived].TmpDate,"%s",
                                 p_startPtr);
                        *p_endPtr = temp_endValue;

                        if (NumDaysReceived > 0)
                        {
                            newDay = ustrcmp((const char *)Tmp_Day[NumDaysReceived-1].TmpDate,
                                             (const char *)Tmp_Day[NumDaysReceived].TmpDate);
                        }

                        if (newDay != 0)
                        {
                            p_startPtr = (uint8_t *)strstr((const char *)locTempString, "ial\" value=");
                            if( NULL != p_startPtr )
                            {
                                p_startPtr = p_startPtr + strlen("ial\" value=") + 1;
                                p_endPtr = (uint8_t *)strstr((const char *)p_startPtr, "\"");
                                if( NULL != p_endPtr )
                                {
                                    temp_endValue = *p_endPtr;
                                    *p_endPtr = 0;
                                    usprintf((char *)Tmp_Day[NumDaysReceived].TmpCurrent,"%s",
                                             p_startPtr);
                                    *p_endPtr = temp_endValue;
                                }
                            }

                            p_startPtr = (uint8_t *)strstr((const char *)locTempString, "\" name=");
                            if( NULL != p_startPtr )
                            {
                                p_startPtr = p_startPtr + strlen("\" name=") + 1;
                                p_endPtr = (uint8_t *)strstr((const char *)p_startPtr, "\"");
                                if( NULL != p_endPtr )
                                {
                                    temp_endValue = *p_endPtr;
                                    *p_endPtr = 0;
                                    usprintf((char *)Tmp_Day[NumDaysReceived].WeatherSymbol,"%s",
                                             p_startPtr);
                                    *p_endPtr = temp_endValue;
                                }
                            }

                            p_startPtr = (uint8_t *)strstr((const char *)locTempString, "min=");
                            if( NULL != p_startPtr )
                            {
                                p_startPtr = p_startPtr + strlen("min=") + 1;
                                p_endPtr = (uint8_t *)strstr((const char *)p_startPtr, "\"");
                                if( NULL != p_endPtr )
                                {
                                    temp_endValue = *p_endPtr;
                                    *p_endPtr = 0;
                                    usprintf((char *)Tmp_Day[NumDaysReceived].TmpMin,"%s",p_startPtr);
                                    *p_endPtr = temp_endValue;
                                }
                            }
                            p_startPtr = (uint8_t *)strstr((const char *)locTempString, "max=");
                            if( NULL != p_startPtr )
                            {
                                p_startPtr = p_startPtr + strlen("max=") + 1;
                                p_endPtr = (uint8_t *)strstr((const char *)p_startPtr, "\"");
                                if( NULL != p_endPtr )
                                {
                                    temp_endValue = *p_endPtr;
                                    *p_endPtr = 0;
                                    usprintf((char *)Tmp_Day[NumDaysReceived].TmpMax,"%s",p_startPtr);
                                    *p_endPtr = temp_endValue;
                                }
                            }
                            NumDaysReceived++;
                        }
                        else
                        {
                            p_startPtr = (uint8_t *)strstr((const char *)locTempString, "min=");
                            if( NULL != p_startPtr )
                            {
                                p_startPtr = p_startPtr + strlen("min=") + 1;
                                p_endPtr = (uint8_t *)strstr((const char *)p_startPtr, "\"");
                                if( NULL != p_endPtr )
                                {
                                    temp_endValue = *p_endPtr;

                                    *p_endPtr = 0;
                                    if (ustrcmp((const char *)Tmp_Day[NumDaysReceived - 1].TmpMin,
                                                (const char *)p_startPtr) == 1)
                                    {
                                        usprintf((char *)Tmp_Day[NumDaysReceived- 1].TmpMin,"%s",
                                                 p_startPtr);
                                    }
                                    *p_endPtr = temp_endValue;
                                }
                            }

