fdfea/Capstone_MSP432/get_time.c
        /*
        App_CB.timeElapsedSec  -= TIME2013;
        App_CB.timeElapsedSec  += (gmt_hr * SEC_IN_HOUR);
        App_CB.timeElapsedSec  += (gmt_min * SEC_IN_MIN);
        App_CB.timeCCPtr = &App_CB.time[0];
        App_CB.timeSGeneralVar = App_CB.timeElapsedSec/SEC_IN_DAY;
        memcpy(App_CB.timeCCPtr, daysOfWeek2013[App_CB.timeSGeneralVar%7], 3);
        App_CB.timeCCPtr += 3;
        *App_CB.timeCCPtr++ = '\x20';
        App_CB.timeSGeneralVar %= 365;
        for (index = 0; index < 12; index++)
        {
            App_CB.timeSGeneralVar -= numOfDaysPerMonth[index];
            if (App_CB.timeSGeneralVar < 0)
                break;
        }
        memcpy(App_CB.timeCCPtr, monthOfYear[index], 3);
        App_CB.timeCCPtr += 3;
        *App_CB.timeCCPtr++ = '\x20';
        App_CB.timeSGeneralVar += numOfDaysPerMonth[index];
        App_CB.timeCCLen = itoa(App_CB.timeSGeneralVar + 1, App_CB.timeCCPtr);
        App_CB.timeCCPtr += App_CB.timeCCLen;
        *App_CB.timeCCPtr++ = '\x20';
        App_CB.timeUGeneralVar = App_CB.timeElapsedSec/SEC_IN_DAY;
        App_CB.timeUGeneralVar /= 365;
        App_CB.timeCCLen = itoa(YEAR2013 + App_CB.timeUGeneralVar , App_CB.timeCCPtr);
        App_CB.timeCCPtr += App_CB.timeCCLen;
        *App_CB.timeCCPtr++ = '\x20';
        App_CB.timeUGeneralVar = App_CB.timeElapsedSec%SEC_IN_DAY;
        App_CB.timeUGeneralVar1 = App_CB.timeUGeneralVar%SEC_IN_HOUR;
        App_CB.timeUGeneralVar /= SEC_IN_HOUR;
        App_CB.timeCCLen = itoa(App_CB.timeUGeneralVar, App_CB.timeCCPtr);
        App_CB.timeCCPtr += App_CB.timeCCLen;
        *App_CB.timeCCPtr++ = ':';
        App_CB.timeUGeneralVar = App_CB.timeUGeneralVar1/SEC_IN_MIN;
        App_CB.timeUGeneralVar1 %= SEC_IN_MIN;
        App_CB.timeCCLen = itoa(App_CB.timeUGeneralVar, App_CB.timeCCPtr);
        App_CB.timeCCPtr += App_CB.timeCCLen;
        *App_CB.timeCCPtr++ = ':';
        App_CB.timeCCLen = itoa(App_CB.timeUGeneralVar1, App_CB.timeCCPtr);
        App_CB.timeCCPtr += App_CB.timeCCLen;
        *App_CB.timeCCPtr++ = '\x20';
        *App_CB.timeCCPtr++ = '\0';

        UART_PRINT("\r\n Server ");
        UART_PRINT("%s",SNTPserver);
        UART_PRINT(" has responded with time information");
        UART_PRINT("\n\r\r\n");
        UART_PRINT("%s",App_CB.time);
        UART_PRINT("\n\r\r\n");
        */
    }

    return 0;
}

/***********************************************************
  Function: getWeather
*/
static int32_t getWeather(void)
{
    int32_t retVal = -1;

    strcpy((char *)App_CB.weatherHostName, WEATHER_SERVER);

    retVal = getHostIPforWeather();
    if(retVal < 0)
    {
        UART_PRINT("Unable to reach Host\n\r");
        ASSERT_ON_ERROR(retVal);
    }

    App_CB.weatherSockID = createConnectionforWeather();
    ASSERT_ON_ERROR(App_CB.weatherSockID);

    strcpy((char *)App_CB.weatherCityName, (const char *)flashDemoConfigParams.city);

    retVal = getForecastData();
    ASSERT_ON_ERROR(retVal);

    retVal = sl_Close(App_CB.weatherSockID);
    ASSERT_ON_ERROR(retVal);
    return 0;
}

/***********************************************************
  Function: getTime
*/
static int32_t getTime()
{
    int32_t retVal = -1;

    strcpy((char *)App_CB.timeHostName, (const char *)SNTPserver);

    retVal = getHostIPforDate();
    if(retVal < 0)
    {
        UART_PRINT(" Unable to reach Host\n\r\n\r");
        ASSERT_ON_ERROR(retVal);
    }

    App_CB.timeSockID = createConnectionforDate();
    ASSERT_ON_ERROR(App_CB.timeSockID);

    retVal = getSNTPTime(flashDemoConfigParams.gmtTimeZoneHR,
                         GMT_TIME_ZONE_MIN);
    ASSERT_ON_ERROR(retVal);

    retVal = sl_Close(App_CB.timeSockID);
    ASSERT_ON_ERROR(retVal);
    return 0;
}

static void *udpServerThreadProc(void* pArg)
{
    int32_t sd = 0;
    int32_t retVal = -1;
    SlSocklen_t ServerSize, ClientSize;
    struct SlTimeval_t TimeVal;
    SlSockAddrIn_t ServerAddr, ClientAddr;
    uint8_t dataBuf[255];

    sd = sl_Socket(SL_AF_INET, SL_SOCK_DGRAM, /*SL_IPPROTO_UDP*/ 0);
    if(sd < 0)
    {
        UART_PRINT("Socket create failed\n\r\n\r");
        return NULL;
    }

    TimeVal.tv_sec = 10;
    TimeVal.tv_usec = 0;
    sl_SetSockOpt(sd, SL_SOL_SOCKET, SL_SO_RCVTIMEO, (_u8 *)&TimeVal, sizeof(TimeVal));

    ServerSize = sizeof(ServerAddr);
    ServerAddr.sin_family = SL_AF_INET;
    ServerAddr.sin_port = sl_Htons(DATA_PORT);
    ServerAddr.sin_addr.s_addr = sl_Htonl(SL_INADDR_ANY);

    retVal = sl_Bind(sd, (SlSockAddr_t *)&ServerAddr, ServerSize);
    if (retVal < 0)
    {
        UART_PRINT("Socket bind failed\r\n");
        return NULL;
    }

    UART_PRINT("Listening on port %d...\r\n", DATA_PORT);

    while (!udpThreadStop)
    {
        ClientSize = sizeof(SlSockAddrIn_t);
        memset(&ClientAddr, 0, ClientSize);
        memset(dataBuf, 0, sizeof(dataBuf));

        retVal = sl_RecvFrom(sd, dataBuf, sizeof(dataBuf), 0,
                             (SlSockAddr_t *)&ClientAddr, (SlSocklen_t*)&ClientSize);
        if (retVal <= 0)
        {
            //UART_PRINT("Recieve timed out\n\r");
            continue;
        }

        UART_PRINT("Recieved %d bytes\r\n", retVal);

        /*
         * Expected SMO Data Packet Structure
         * ======================================================
         * 1 byte -- Medication Event packet header type (0x98)
         * ------------------------------------------------------
         * 1 byte -- how many Medication Events (1-6)
         * ======================================================
         * n * (35) bytes -- array of Medication Events
         * ======================================================
         * Medication Event Data Structure
         * ======================================================
         * 1 byte -- hour to take (0-23)
         * ------------------------------------------------------
         * 1 byte -- min to take (0-59)
         * ------------------------------------------------------
         * 1 byte -- how many to take (1-5)
         * ------------------------------------------------------
         * 1 byte -- which compartment (1-6)
         * ------------------------------------------------------
         * 1 byte -- length used by medication information
         * ------------------------------------------------------
         * 30 bytes (chars) -- medication information
         * ======================================================
         */
        int Res = 0;

        //check simple packet formatting
        if (dataBuf[0] != SMO_PACKET_TYPE_HEADER)
        {
            UART_PRINT("Invalid packet type recieved\r\n");
            continue;
        }

        uint8_t nMeds = dataBuf[1];
        if (nMeds == 0 || nMeds > SMO_PACKET_MAX_MEDS)
        {
            UART_PRINT("Invalid number of meds recieved\r\n");
            continue;
        }

        //copy received data into packet
        SMO_Packet Pkt;
        memcpy(&Pkt, dataBuf, SMO_PACKET_HEADER_SIZE + nMeds * sizeof(SMO_PacketMed));

        newTime = MAP_RTC_C_getCalendarTime();

        //configure SMO from user data
        pthread_mutex_lock(&SMO_Mutex);
        Res = SMO_Control_configure(&SMO_Ctrl, &Pkt);
        pthread_mutex_unlock(&SMO_Mutex);
        if (Res < 0)
        {
            UART_PRINT("Error configuring SMO\r\n");
            continue;
        }

        //schedule first event
        pthread_mutex_lock(&SMO_Mutex);
        Res = SMO_scheduleNextEvent(&SMO_Ctrl, newTime.hours, newTime.minutes);
        pthread_mutex_unlock(&SMO_Mutex);
        if (Res < 0)
        {
            UART_PRINT("Error scheduling event\r\n");
        }
    }

    retVal = sl_Close(sd);
    if (retVal < 0)
    {
        UART_PRINT("Socket close failed\r\n");
    }
    return NULL;
}

