fdfea/Capstone_MSP432/get_time.c
/****************************************************************************************************************
                 Main Thread
****************************************************************************************************************/
void mainThread(void * args)
{
    int32_t retc = 0;

    /* Thread vars */
    pthread_t spawn_thread = (pthread_t) NULL;
    pthread_attr_t pAttrs_spawn;
    struct sched_param priParam;

    Button_Params  buttonParams;

    /* Peripheral parameters and handles */
    UART_Handle tUartHndl;

    /* Clear lockUDID */
    memset(&App_CB.lockUDID[0], 0x00, sizeof(App_CB.lockUDID));

    /* Initialize SlNetSock layer with CC3x20 interface                      */
    SlNetIf_init(0);
    SlNetIf_add(SLNETIF_ID_1, "CC3220", (const SlNetIf_Config_t *) &SlNetIfConfigWifi, SLNET_IF_WIFI_PRIO);

    SlNetSock_init(0);
    SlNetUtil_init(0);

    /* Init pins used as GPIOs */
    GPIO_init();
    /* Init buttons driver */
    Button_init();
    /* Init SPI for communicating between M4 and NWP */
    SPI_init();

    /* Configure the UART                                                     */
    tUartHndl = InitTerm();
    /* remove uart receive from LPDS dependency                               */
    UART_control(tUartHndl, UART_CMD_RXDISABLE, NULL);


    Button_Params_init(&buttonParams);
    okayButtonHandle = Button_open(CONFIG_BUTTON_0, SMO_okayButtonHandler, &buttonParams);

    if (okayButtonHandle == NULL)
    {
        UART_PRINT("Button open failed\r\n");
    }

    /* Create the sl_Task                                                     */
    pthread_attr_init(&pAttrs_spawn);
    priParam.sched_priority = SPAWN_TASK_PRIORITY;
    retc |= pthread_attr_setschedparam(&pAttrs_spawn, &priParam);
    retc |= pthread_attr_setstacksize(&pAttrs_spawn, TASK_STACK_SIZE);
    retc |= pthread_attr_setdetachstate(&pAttrs_spawn, PTHREAD_CREATE_DETACHED);

    retc |= pthread_create(&spawn_thread, &pAttrs_spawn, sl_Task, NULL);
    if (retc != 0)
    {
        UART_PRINT("could not create simplelink task\n\r");
        while (1); // Insert error handling
    }

    /* Started to allow host to read back MAC address when printing App banner */
    retc = sl_Start(0, 0, 0);
    if (retc < 0)
    {
        /* Handle Error */
        UART_PRINT("\n sl_Start failed\n");
        while (1);// Insert error handling
    }

    /* Output device information to the UART terminal                         */
    retc = DisplayAppBanner(APPLICATION_NAME, APPLICATION_VERSION);

    retc = sl_Stop(SL_STOP_TIMEOUT);
    if (retc < 0)
    {
        /* Handle Error */
        UART_PRINT("\n sl_Stop failed\n");
        while (1);
    }

    pthread_mutexattr_t Attr;
    pthread_mutexattr_init(&Attr);
    pthread_mutexattr_settype(&Attr, PTHREAD_MUTEX_RECURSIVE);
    pthread_mutex_init(&SMO_Mutex, &Attr);

    /* Main application loop */
    while (1)
    {
        UART_PRINT("\n\r\n\r**** Starting main loop ****\n\r");

        App_CB.resetApplication = false;
        App_CB.initState = 0;

        /* Connect to AP */
        UART_PRINT("Using hardcoded profile for connection.\n\r");
        App_CB.apConnectionState = WiFi_IF_Connect();

        RTC_init();
        SMO_Control_init(&SMO_Ctrl);

        udpThreadStop = false;
        pthread_t udpServerThread;
        pthread_attr_t udpThreadAttr;
        pthread_attr_init(&udpThreadAttr);
        retc |= pthread_attr_setstacksize(&udpThreadAttr, TASK_STACK_SIZE);
        retc |= pthread_attr_setdetachstate(&udpThreadAttr, PTHREAD_CREATE_DETACHED);
        retc |= pthread_create(&udpServerThread, &udpThreadAttr, udpServerThreadProc, NULL);
        if (retc < 0)
        {
            UART_PRINT("UDP Server create failed\r\n");
            while (1);
        }

        /*
        i2cThreadStop = false;
        pthread_t i2cThread;
        pthread_attr_t i2cThreadAttr;
        pthread_attr_init(&i2cThreadAttr);
        retc |= pthread_attr_setstacksize(&i2cThreadAttr, TASK_STACK_SIZE);
        retc |= pthread_attr_setdetachstate(&i2cThreadAttr, PTHREAD_CREATE_DETACHED);
        retc |= pthread_create(&i2cThread, &i2cThreadAttr, i2cThreadProc, NULL);
        if (retc < 0)
        {
            UART_PRINT("i2c Thread create failed\r\n");
            while (1);
        }
        */

        retc = getTime();

        App_CB.timeElapsedSec -= TZ_EST_OFFSET_SECS;

        RTC_setTime((time_t) App_CB.timeElapsedSec);

        /*
        SMO_Packet Pkt;
        Pkt.PacketType = 98;
        Pkt.nMeds = 3;
        {
            SMO_PacketMed Med1;
            Med1.AlarmHour = 17;
            Med1.AlarmMin = 39;
            Med1.nCmptmt = 1;
            Med1.nPills = 2;
            Med1.Length = 10;
            memcpy(Med1.Payload, "Medicine1", Med1.Length);

            SMO_PacketMed Med2;
            Med2.AlarmHour = 17;
            Med2.AlarmMin = 45;
            Med2.nCmptmt = 2;
            Med2.nPills = 1;
            Med2.Length = 10;
            memcpy(Med2.Payload, "Medicine2", Med2.Length);

            SMO_PacketMed Med3;
            Med3.AlarmHour = 17;
            Med3.AlarmMin = 42;
            Med3.nCmptmt = 3;
            Med3.nPills = 1;
            Med3.Length = 10;
            memcpy(Med3.Payload, "Medicine3", Med3.Length);

            Pkt.Meds[0] = Med1;
            Pkt.Meds[1] = Med2;
            Pkt.Meds[2] = Med3;
        }

        pthread_mutex_lock(&SMO_Mutex);
        retc = SMO_Control_configure(&SMO_Ctrl, &Pkt);
        pthread_mutex_unlock(&SMO_Mutex);
        if (retc < 0)
        {
            UART_PRINT("Error configuring SMO\r\n");
        }

        pthread_mutex_lock(&SMO_Mutex);
        retc = SMO_scheduleNextEvent(&SMO_Ctrl, newTime.hours, newTime.minutes);
        pthread_mutex_unlock(&SMO_Mutex);
        if (retc < 0)
        {
            UART_PRINT("Error scheduling event\r\n");
        }
        */

        while (App_CB.resetApplication == false)
        {
            UART_PRINT("Date: %s\r\n", RTC_getDate());

            sleep(10);
        }

