fdfea/Capstone_MSP432/get_time.c
        udpThreadStop = true;
        i2cThreadStop = true;

        //wait for server to stop
        pthread_join(udpServerThread, NULL);
        //wait for i2c to stop
        /*
        pthread_join(i2cThread, NULL);
        */
    }

    //SMO_Control_free(&SMO_Ctrl);
    //RTC_free();
}

/*
 * Interrupt handler for RTC Alarm
 */
extern void RTC_C_IRQHandler(uintptr_t Arg)
{
    uint32_t status;

    status = MAP_RTC_C_getEnabledInterruptStatus();
    MAP_RTC_C_clearInterruptFlag(status);

    newTime = MAP_RTC_C_getCalendarTime();

    if (status & RTC_C_CLOCK_READ_READY_INTERRUPT)
    {

    }

    if (status & RTC_C_TIME_EVENT_INTERRUPT)
    {
        UART_PRINT("RTC Int: Minute Passed\r\n");

        //update screen time display every minute
        //Screen_updateTime(newTime.minutes, newTime.hours);

        pthread_mutex_lock(&SMO_Mutex);
        if (SMO_Ctrl.Timer.Timing)
        {
            SMO_Ctrl.Timer.Count++;
            if (SMO_Ctrl.Timer.Count == SMO_EVENT_TIMEOUT_MINS)
            {
                SMO_Timer_stop(&SMO_Ctrl.Timer);
                SMO_handleTimeout();
            }
        }
        pthread_mutex_unlock(&SMO_Mutex);
    }

    if (status & RTC_C_CLOCK_ALARM_INTERRUPT)
    {
        int Res = 0;
        UART_PRINT("RTC Int: Alarm Triggered\r\n");

        pthread_mutex_lock(&SMO_Mutex);
        if (SMO_Ctrl.Timer.Timing)
        {
            SMO_Timer_stop(&SMO_Ctrl.Timer);
            SMO_stopEvent();
        }
        Res = SMO_handleEvent(&SMO_Ctrl);
        pthread_mutex_unlock(&SMO_Mutex);
        if (Res < 0)
        {
            UART_PRINT("Error handling event\r\n");
        }
        else
        {
            pthread_mutex_lock(&SMO_Mutex);
            SMO_Timer_start(&SMO_Ctrl.Timer);
            pthread_mutex_unlock(&SMO_Mutex);
        }

        pthread_mutex_lock(&SMO_Mutex);
        Res = SMO_scheduleNextEvent(&SMO_Ctrl, newTime.hours, newTime.minutes);
        pthread_mutex_unlock(&SMO_Mutex);
        if (Res < 0)
        {
            UART_PRINT("Error scheduling next event\r\n");
        }
    }
}

static void SMO_okayButtonHandler(Button_Handle handle, Button_EventMask events)
{
    if (Button_EV_CLICKED == (events & Button_EV_CLICKED))
    {
        UART_PRINT("Okay button clicked\r\n");
        pthread_mutex_lock(&SMO_Mutex);
        //user presses button to acknowledge event
        if (SMO_Ctrl.Timer.Timing)
        {
            SMO_Timer_stop(&SMO_Ctrl.Timer);
            SMO_stopEvent();
        }
        pthread_mutex_lock(&SMO_Mutex);
    }
}

static void SMO_handleTimeout(void)
{
    UART_PRINT("Event timer timed out\r\n");
    //when timer goes off, stop peripherals
    SMO_stopEvent();
}

static void SMO_stopEvent(void)
{
    UART_PRINT("Stopping SMO event\r\n");
    //stop LEDs
    //LED_allOff();

    //remove med info from screen
    //Screen_removeMedInfo();

    //turn off speaker
    //Speaker_off();
}

static int SMO_scheduleNextEvent(SMO_Control *Ctrl, uint8_t Hour, uint8_t Min)
{
    int Res = 0;

    SMO_Event *NextEvent = SMO_Control_nextEvent(Ctrl, Hour, Min);
    if (NextEvent == NULL)
    {
        UART_PRINT("No event available\r\n");
        Res = -EINVAL;
        goto Error;
    }

    UART_PRINT("Scheduling next event for %d:%d\r\n", NextEvent->AlarmHour, NextEvent->AlarmMin);
    //set an alarm for the next event
    RTC_setAlarm(NextEvent->AlarmMin, NextEvent->AlarmHour, RTC_C_ALARMCONDITION_OFF, RTC_C_ALARMCONDITION_OFF);

    //save the event so we know what to do when alarm triggers
    Ctrl->CurrentEvent = NextEvent;

Error:
    return Res;
}

static int SMO_handleEvent(SMO_Control *Ctrl)
{
    int Res = 0;
    char ScreenStr[255];
    char *BeginStr = &ScreenStr[0], *CurrentStr = &ScreenStr[0], *MedStr = NULL;
    uint8_t Tmp, Index, Compartments = Ctrl->CurrentEvent->Compartments;

    if (Ctrl->CurrentEvent == NULL)
    {
        UART_PRINT("No event ready\r\n");
        Res = -EINVAL;
        goto Error;
    }

    UART_PRINT("Starting SMO event\r\n");

    while (Compartments != 0ULL)
    {
        Tmp = Compartments & -Compartments;
        Index = 31 - __CLZ(Tmp);

        //handle LEDs
        UART_PRINT("Lighting LED %d\r\n", Index);
        //LED_on(Index);

        //add med info to screen string
        MedStr = SMO_Control_getMedStr(Ctrl, Index);
        if (MedStr != NULL)
        {
            CurrentStr += sprintf(CurrentStr, "%s, Cmptmt: %d, Pills: %d\r\n",
                                  MedStr, Index, Ctrl->CurrentEvent->nPills[Index]);
        }

        Compartments ^= Tmp;
    }

    //display med info
    UART_PRINT("Displaying on screen:\r\n%s", BeginStr);
    //Screen_printMedInfo(ScreenStr);

    //turn on speaker
    UART_PRINT("Turning speaker on\r\n");
    //Speaker_on();

Error:
    return Res;
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
